## **Customer Churn Prediction System using Deep Learning**

In [1]:



# Importing the dependecies
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix, roc_auc_score
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import LabelEncoder
from keras import Sequential
from keras.layers import Dense, Dropout, BatchNormalization
import tensorflow as tf

In [7]:
df = pd.read_csv(r"C:\Users\Subham Pathak\Desktop\AI\DEEP_LEARNING\datasets\Churn_Modelling.csv")

df.head()

   RowNumber  CustomerId   Surname  CreditScore Geography  Gender  Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary  Exited
0          1    15634602  Hargrave          619    France  Female   42       2       0.00              1          1               1        101348.88       1
1          2    15647311      Hill          608     Spain  Female   41       1   83807.86              1          0               1        112542.58       0
2          3    15619304      Onio          502    France  Female   42       8  159660.80              3          1               0        113931.57       1
3          4    15701354      Boni          699    France  Female   39       1       0.00              2          0               0         93826.63       0
4          5    15737888  Mitchell          850     Spain  Female   43       2  125510.82              1          1               1         79084.10       0

### **Data Preprocessing**

In [8]:
df.info()
df.drop_duplicates()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

      RowNumber  CustomerId    Surname  CreditScore Geography  Gender  Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary  Exited
0             1    15634602   Hargrave          619    France  Female   42       2       0.00              1          1               1        101348.88       1
1             2    15647311       Hill          608     Spain  Female   41       1   83807.86              1          0               1        112542.58       0
2             3    15619304       Onio          502    France  Female   42       8  159660.80              3          1               0        113931.57       1
3             4    15701354       Boni          699    France  Female   39       1       0.00              2          0               0         93826.63       0
4             5    15737888   Mitchell          850     Spain  Female   43       2  125510.82              1          1               1         79084.10       0
...         ...         ...        ...          ...       ...     ...  ...     ...        ...            ...        ...             ...              ...     ...
9995       9996    15606229   Obijiaku          771    France    Male   39       5       0.00              2          1               0         96270.64       0
9996       9997    15569892  Johnstone          516    France    Male   35      10   57369.61              1          1               1        101699.77       0
9997       9998    15584532        Liu          709    France  Female   36       7       0.00              1          0               1         42085.58       1
9998       9999    15682355  Sabbatini          772   Germany    Male   42       3   75075.31              2          1               0         92888.52       1
9999      10000    15628319     Walker          792    France  Female   28       4  130142.79              1          1               0         38190.78       0

[10000 rows x 14 columns]

In [9]:
df= df.drop(columns=['RowNumber', 'CustomerId', 'Surname'], axis=1)
df

      CreditScore Geography  Gender  Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary  Exited
0             619    France  Female   42       2       0.00              1          1               1        101348.88       1
1             608     Spain  Female   41       1   83807.86              1          0               1        112542.58       0
2             502    France  Female   42       8  159660.80              3          1               0        113931.57       1
3             699    France  Female   39       1       0.00              2          0               0         93826.63       0
4             850     Spain  Female   43       2  125510.82              1          1               1         79084.10       0
...           ...       ...     ...  ...     ...        ...            ...        ...             ...              ...     ...
9995          771    France    Male   39       5       0.00              2          1               0         96270.64       0
9996          516    France    Male   35      10   57369.61              1          1               1        101699.77       0
9997          709    France  Female   36       7       0.00              1          0               1         42085.58       1
9998          772   Germany    Male   42       3   75075.31              2          1               0         92888.52       1
9999          792    France  Female   28       4  130142.79              1          1               0         38190.78       0

[10000 rows x 11 columns]

In [10]:
df = pd.get_dummies(df, columns=['Geography'], drop_first = True)
df

      CreditScore  Gender  Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary  Exited  Geography_Germany  Geography_Spain
0             619  Female   42       2       0.00              1          1               1        101348.88       1              False            False
1             608  Female   41       1   83807.86              1          0               1        112542.58       0              False             True
2             502  Female   42       8  159660.80              3          1               0        113931.57       1              False            False
3             699  Female   39       1       0.00              2          0               0         93826.63       0              False            False
4             850  Female   43       2  125510.82              1          1               1         79084.10       0              False             True
...           ...     ...  ...     ...        ...            ...        ...             ...              ...     ...                ...              ...
9995          771    Male   39       5       0.00              2          1               0         96270.64       0              False            False
9996          516    Male   35      10   57369.61              1          1               1        101699.77       0              False            False
9997          709  Female   36       7       0.00              1          0               1         42085.58       1              False            False
9998          772    Male   42       3   75075.31              2          1               0         92888.52       1               True            False
9999          792  Female   28       4  130142.79              1          1               0         38190.78       0              False            False

[10000 rows x 12 columns]

In [11]:
le = LabelEncoder()
df['Gender'] = le.fit_transform(df['Gender'])
df['Geography_Germany'] = le.fit_transform(df['Geography_Germany'])
df['Geography_Spain'] = le.fit_transform(df['Geography_Spain'])
df

      CreditScore  Gender  Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary  Exited  Geography_Germany  Geography_Spain
0             619       0   42       2       0.00              1          1               1        101348.88       1                  0                0
1             608       0   41       1   83807.86              1          0               1        112542.58       0                  0                1
2             502       0   42       8  159660.80              3          1               0        113931.57       1                  0                0
3             699       0   39       1       0.00              2          0               0         93826.63       0                  0                0
4             850       0   43       2  125510.82              1          1               1         79084.10       0                  0                1
...           ...     ...  ...     ...        ...            ...        ...             ...              ...     ...                ...              ...
9995          771       1   39       5       0.00              2          1               0         96270.64       0                  0                0
9996          516       1   35      10   57369.61              1          1               1        101699.77       0                  0                0
9997          709       0   36       7       0.00              1          0               1         42085.58       1                  0                0
9998          772       1   42       3   75075.31              2          1               0         92888.52       1                  1                0
9999          792       0   28       4  130142.79              1          1               0         38190.78       0                  0                0

[10000 rows x 12 columns]

In [12]:
col = 'Exited'
df = df[[i for i in df.columns if i!=col]+ [col]]
df

      CreditScore  Gender  Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary  Geography_Germany  Geography_Spain  Exited
0             619       0   42       2       0.00              1          1               1        101348.88                  0                0       1
1             608       0   41       1   83807.86              1          0               1        112542.58                  0                1       0
2             502       0   42       8  159660.80              3          1               0        113931.57                  0                0       1
3             699       0   39       1       0.00              2          0               0         93826.63                  0                0       0
4             850       0   43       2  125510.82              1          1               1         79084.10                  0                1       0
...           ...     ...  ...     ...        ...            ...        ...             ...              ...                ...              ...     ...
9995          771       1   39       5       0.00              2          1               0         96270.64                  0                0       0
9996          516       1   35      10   57369.61              1          1               1        101699.77                  0                0       0
9997          709       0   36       7       0.00              1          0               1         42085.58                  0                0       1
9998          772       1   42       3   75075.31              2          1               0         92888.52                  1                0       1
9999          792       0   28       4  130142.79              1          1               0         38190.78                  0                0       0

[10000 rows x 12 columns]

In [13]:
# (0,0) => France,     (0,1) => Spain,     (1,0) = Germany,         0 = Female,   1 => Male

x = df.iloc[:, :-1]
y = df['Exited']
df['Exited'].value_counts()

Exited
0    7963
1    2037
Name: count, dtype: int64

In [ ]:
from imblearn.over_sampling import SMOTE
sm = SMOTE()
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state = 42, stratify = y)
x_train_res, y_train_res = sm.fit_resample(x_train, y_train)

In [ ]:
sc = StandardScaler()
scaling = ['CreditScore', 'Balance', 'EstimatedSalary']
x_train_res[scaling] = sc.fit_transform(x_train_res[scaling])
x_test[scaling] = sc.transform(x_test[scaling])


model = Sequential()

model.add(Dense(64, activation='relu', input_dim = 11))
model.add(BatchNormalization())
model.add(Dropout(0.3))

model.add(Dense(32, activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(0.2))

model.add(Dense(16, activation='relu'))
model.add(BatchNormalization())
model.add(Dropout(0.1))

model.add(Dense(1, activation='sigmoid'))

In [ ]:
model.compile(
    optimizer='adam',
    loss='binary_crossentropy',
    metrics=['accuracy', tf.keras.metrics.AUC(name='auc')]
)

In [ ]:
history = model.fit(
    x_train_res,
    y_train_res,
    epochs=50,
    batch_size=32,
    validation_split=0.2,
    verbose=1
)

In [ ]:
y_pred = (model.predict(x_test) > 0.5).astype(int)

print("Classification Report:\n")
print(classification_report(y_test, y_pred))

print("\nConfusion Matrix:\n")
print(confusion_matrix(y_test, y_pred))

print("\nROC-AUC Score:", roc_auc_score(y_test, y_pred))

In [ ]:
fig, ax = plt.subplots()
ax.plot(history.history['accuracy'])

In [ ]:
plt.plot(history.history['loss'])